/* let datas = [
    "15.05.2024",
    "19.05.2024",
    "11.05.2024 ",
]

let Names = [
    "Халықаралық конференция",
    "Бірге еске аламыз,..!",
    "Рейд",
]

let Photos = [
    [
        "./content/1n1p.JPG",
        "./content/1n2p.JPG",
        "./content/1n3p.JPG",
        "./content/1n4p.JPG",
        "./content/1n5p.JPG",
    ],
    [
        "./content/2n1p.JPG",
        "./content/2n2p.JPG",
        "./content/2n3p.JPG",
        "./content/2n4p.JPG",
        "./content/2n5p.JPG",
    ],
    [
        "./content/3n1p.JPG",
        "./content/3n2p.JPG",
        "./content/3n3p.JPG",
    ]
]

let texts = [

    [
        " Конференция техникалық және кәсіптік білім беру ұйымдары педагогтарының педагогикалық кәсіби қарым-қатынас алаңын құруға, инклюзивтік білім беру технологияларын қолдану барысы бойынша тәжірибе алмасуға, кәсіби құзіретті маманның сапасын арттыруға, ерекше білім беруді қажет ететін студенттерге арналған арнайы пән оқулықтарын әзірлеудегі мәселелерге бағытталды.",

        "Конференцияға Германиядан SES (SeniorExperten Service)  халықаралық эксперті,  Сауда  және өнеркәсіп палатасының өкілі, ерекше білім беру қажеттіліктері бар тұлғалар (ақыл-ойы сақталмаған) үшін  қайта даярлау  бойынша кәсіпкерлер мен технологтарға арналған ағылшын тілі пәнінің оқытушысы Хайке Гюнтер және Қырғызстан халықаралық универсалды колледжінің директоры Кожомкулова Наргиза Адамкалыевна, Қырғызстан Республикасы, Қырғызстан халықаралық универсалды колледжінің оқытушысы Алиева Наргиза Жумадиловна арнайы келіп қатысты. ",

        "Сонымен қатар, көршілес Ресей елінен және республикамыздың әр өңірінен баяндамашылар ZOOM платформасы арқылы байланысқа шығып, ерекше білім беруге қатысты өз тәжірибелерімен бөлісті. Ғылыми - әдістемелік конференция қонақтары ”ORDA” жоғары колледжі базасын аралап, «Кәсіптік білім – кәсіпкерлік бастауы» атты  өндіріс бұйымдары және «Инклюзивті оқытуды енгізудің шарттары» көрмесімен танысты.",
    ],

    [
        "“ORDA” жоғары колледжінде 19 мамыр – Халықаралық  СПИД ауруынан қайтыс болғандарды еске алу күнiне орай  «Бірге еске аламыз, бірге махаббат пен ынтымақтастық арқылы емделеміз!» тақырыбында жастар акциясы өтті. Акция Қызылорда облыстық АИТВ инфекциясының алдын алу орталығы және “ORDA” жоғары колледжінің бірлесуімен ұйымдастырылды.",

        "Шара барысында колледж директоры Досжанова Гүлжамила Сермағанбетқызы сөз сөйлеп, акция мақсатымен таныстырды.  Жастар денсаулық орталығының ұйымдастыру-әдістемелік бөлімінің дәрігері Каусова Сәуле Исмагуловна СПИД ауруы,  АИТВ инфекциясының алдын алу жолдары туралы ақпараттарымен бөлісті.",

        "Акция соңында белсенді жастар өнерлерін көрсетті. Қызылорда облыстық АИТВ инфекциясының алдын алу орталығының бас дәрігерінің орынбасары Утегенова Шолпан Жеңісбекқызы акцияның ұйымдастырылуы мен  жүргізілуіне атсалысқан «ORDA» жоғары колледж директоры Досжанова Гүлжамила Сермағанбетқызы, директордың оқу-тәрбие жұмысы жөніндегі орынбасары Абдибаттаева Гүлнар Мәуленқызы және Жастар ісі жөніндегі комитет жетекшісі Рзахметова Перизат Нұрланқызын алғысхатпен марапаттады.  Белсенді студенттерге   арнайы сыйлықтар табыс етті."
    ],

    [
       "Жасөспірімдер арасындағы құқық бұзушылықтардың алдын алу мақсатындағы түнгі рейд жұмыстары жалғасуда. 10 мамыр күні колледж оқытушылары арнайы кесте бойынша жасөспірім-студенттердің беймезгіл жүрістеріне қадағалау жүргізді.",

       "Қазақстан Республикасының заңнамасына сәйкес, егер бала (18 жасқа толмаған) ата-анасының немесе заңды өкілдерінің еріп жүруінсіз дұрыс емес уақытта (сағат 22:00-ден 06:00-ге дейін) болса, онда ол ішкі істер органдарына түсуі мүмкін. станциясы."
    ]
] */

let datas = [
    "31.05.2024",
    "28.05.2024",
    "27.05.2024",
]

let Names = [
    "Саяси қуғын-сүргін және ашаршылық құрбандарын еске алу күні",
    "Түсіндірме жұмыстары",
    "Құқықтық тәрбие - қауіпсіз қоғам",
]

let Photos = [
    [
        "./may-31/1-0-1.jpg",
    ],
    [
        "./news-img/3-7.jpg",
        "./news-img/3-1.jpg",
        "./news-img/3-2.jpg",
        "./news-img/3-3.jpg",
        "./news-img/3-4.jpg",
        "./news-img/3-5.jpg",
        "./news-img/3-6.jpg",

    ],
    [
        "./image/1-3-4.jpg",
        "./image/1-1-4.jpg",
        "./image/1-2-4.jpg",
    ],
]

let texts = [

    [
        "Сондай-ақ Қазақстанда 1921-1954 жылдар аралығында 100 мыңға жуық адам сотталып, 20 мыңнан астам адам атылып кетті. Олардың қатарында қазақ халқының көптеген танымал өкілдері болды.",

        "31 МАМЫР – Саяси қуғын-сүргін және ашаршылық құрбандарын еске алу күні. Бүгін Қазақстан халқы сталиндік режим тұсында жазықсыз қаза тапқандарды еске алады.",
        
        "1926 жылғы КСРО халықтарының санағы бойынша 3 968 289 қазақ өмір сүрсе, 1937 жылы олардың саны 2 862 458 адамға дейін қысқарды. Нақтырақ айтсақ, қазақтардың 72,1%-ы ғана аман қалды. Ал кейбір тарихшылар ашаршылық құрбандарының санына көбірек баға береді. Тек 1970 жылы қазақтар өз сандарын 1926 жылғы деректермен қалпына келтірді. ",
    ],

    [
        "Асқар Қосылбайұлы жасөспірімдер арасындағы құқықбұзушылық түрлеріне сипаттама беріп, деректер келтірді. Қылмыс жасалған жағдайда әрбір азамат заңда көрсетiлген ереже бойынша жауапкершiлiкке тартылатынын, Қазақстанда заң бойынша кәмелетке толмаған жасөспірімдерге түнгі сағат 22.00-ден кейін компьютерлік клубтарда отыруға және түнгі сағат 23.00-ден кейін көшеде ата-анасыз жүруге тыйым салынғанын айтып өтті. ",

        "Құқықтық білім беру арқылы жасөспірім құқықтың не екенін ұғынады және оның санасы қалыптасып, дамиды. Өскелең ұрпақтың дұрыс тәрбие алып, қоғамдағы құқықтарын пайдалана біліп, қатыгездіксіз өмірлерінің сақталуы жолында аянбай еңбек ету – біздің басты парыз.",

        "“ORDA” жоғары колледжінде бірнеше басқармалардың бірлескен қадамдық жоспарына сәйкес кәмелеттік жасқа толмағандар арасындағы әкімшілік құқық бұзушылықтардың алдын алу бойынша сала мамандарының қатысуымен құқықтық түсіндірме жұмысы жүргізілді.",

        "✅ Түсіндірме жұмысына:<br>🔺Қызылорда облысының кәмелетке толмағандардың істері жөніндегі мамандандырылған ауданаралық сотының судьясы - Зәбира Абылайкызы;<br> 🔺Бас маман - сот отырысының хатшысы - Нұрғалиев Асқар Қосылбайұлы;<br>🔺Директордың оқу-тәрбие жумыстары женіндегі орынбасары - Абдибаттаева Гүлнар Мәуленқызы және колледж студенттері қатысты.",

        "Бүгінгі таңда қоғамның алдында тұрған басты міндеттердің бірі — жасөспірімдер арасындағы құқық бұзушылықтың алдын-алу, кәмелетке толмағандар арасындағы қылмыстың өсуіне жол бермеу.",

        "Шара барысында Зәбира Абылайқызы қала көлемінде кәмелетке толмағандар арасында жалпы орын алып отырған құқық бұзушылықтарға тоқтала кетіп, кәмелетке толмағандар 14 жастан бастап қылмыстық жауапкершілікке, ал 16 жастан бастап әкімшілік құқықбұзушылық бойынша жауапкершілікке тартылатынын ескертіп, қылмыс түрлерін саралап, оның жауапкершілігі жайлы түсіндіріп өтті.",
        

    ],

    [
        "Тұлғаны жан-жақты үйлесімді тәрбиелеу саласының бірі – құқықтық тәрбие. Ол қоғамның әрбір азаматының мемлекеттік заңдарды аса жауапкершілікпен орындап отыруымен тығыз байланысты.<br> Құқықтық сауаты жоғары жастардың қылмысқа бармауы да ақиқат.",

        "ДШ-9-13г оқу тобында студенттердің құқықтық сауаттылығын арттыруға, жасөспірімдер арасындағы қылмыстың алдын алуға бағытталған ''Құқықтық тәрбие - қауіпсіз қоғам'' тақырыбында тәрбие сағаты өтті. Топ жетекшісі Н.Баймбетов жастардың құқықтық сауаттылығын арттыратын ақпараттар беріп, заңдылықтармен таныстырды.",

        "Топ студенттері әрбір Қазақстан азаматының қатаң сақтауына тиісті заңнамаларды жинақтап, презентация арқылы достарымен бөлісті. <br> Заңға бағынсаң, ЗЫҢ жүресің👍.<br> Сондықтан, достар, өз құқығымызды білейік және өзгенің құқығына қол сұқпайық! Тек жүрсең, тек жүресің! "
    ],
]

let data = document.getElementById("data")
let img = document.getElementById("news_photo")
let naame = document.getElementById("news_name")
let text = document.getElementById("change")

let news_now = 0

let news_img_num = 0
let news_text_num = 0

/* console.log(news_now) */

function chabgenews() {
    if (news_now >= (Names.length - 1)) {
        news_now = 0
        console.log(news_now)
    } else {
        news_now++
        console.log(news_now)
    }
    chagImg()
    changText()
    data.innerHTML = datas[news_now]
    naame.innerHTML = Names[news_now]
}
setInterval(chabgenews, 30000)

function changecContet() {

    data.innerHTML = datas[news_now]

    naame.innerHTML = Names[news_now]

}

setInterval(changecContet, 1000)

function chagImg() {
    if (news_img_num >= (Photos[news_now].length - 1)) {
        news_img_num = 0
    } else {
        news_img_num++
    }
    img.src = Photos[news_now][news_img_num]
}

function changText() {
    if (news_text_num >= (texts[news_now].length - 1)) {
        news_text_num = 0
    } else {
        news_text_num++
    }
    text.innerHTML = texts[news_now][news_text_num]
}

changText()
chagImg()
setInterval(chagImg, 15000)
setInterval(changText, 40000)